using DynamicPolynomials, NumericalRepresentationTheory, Permutations

function coeff_matrix(polys, monos)
    m = length(polys)
    n = length(monos)
    C = zeros(Float64, n, m)
    for (i, p) in enumerate(polys)
        # build a Dict: monomial => coefficient for fast lookup
        d = Dict(zip(monomials(p), coefficients(p)))
        for (j, mono) in enumerate(monos)
            C[j, i] = get(d, mono, 0.0)
        end
    end
    return C
end

function polypermgen(n, p)
    @polyvar x[1:n] monomial_order = Graded{DynamicPolynomials.Reverse{LexOrder}}

    μ = monomials(x, p)
    d = length(μ)

    τ = typeof(spzeros(Int,d,d))[]
    for k = 1:n-1
        push!(τ, spzeros(Int, d, d))
        σ = sortperm(subs.(μ, x[k] => x[k+1], x[k+1] => x[k]))
        setindex!.(Ref(τ[k]), 1, σ, 1:d)
    end
    Representation(τ)
end


#####
# n = 3
#####

n = 3

@polyvar x[1:n]
@polyvar y[1:n]
@polyvar z[1:n]

###
# n = 3 1D, All polys from Fake polys
###

fₜ = 1 # trivial
f₂₊₁ = [(x[1]-x[2])/sqrt(2), (x[1]+x[2])/sqrt(6) - sqrt(2/3) * x[3]]
f₂₊₁₂ = [(x[1]^2-x[2]^2)/sqrt(2), (x[1]^2+x[2]^2)/sqrt(6) - sqrt(2/3) * x[3]^2]
fₛ = (x[1]-x[2])*(x[1]-x[3])*(x[2]-x[3])


ρₜ = Representation(3)
ρ₂₊₁ = Representation(2,1)
ρₛ = Representation(1,1,1)

τ₁ = Permutation([[1,2], [3]])
c = Permutation([[1,2,3]])


@test all(subs(fₜ, x[1] => x[2], x[2] => x[1]) .≈ ρₜ(τ₁) * fₜ)
@test all(subs(fₜ,  ([x[2:n]; x[1]] .=> x)...) .≈ ρₜ(c) * fₜ)

@test all(subs(f₂₊₁, x[1] => x[2], x[2] => x[1]) .≈ ρ₂₊₁(τ₁) * f₂₊₁)
@test all(subs(f₂₊₁,  ([x[2:n]; x[1]] .=> x)...) .≈ ρ₂₊₁(c) * f₂₊₁)

@test all(subs(f₂₊₁₂, x[1] => x[2], x[2] => x[1]) .≈ ρ₂₊₁(τ₁) * f₂₊₁₂)
@test all(subs(f₂₊₁₂,  ([x[2:n]; x[1]] .=> x)...) .≈ ρ₂₊₁(c) * f₂₊₁₂)

@test subs(fₛ , x[1] => x[2], x[2] => x[1]) ≈ only(ρₛ(τ₁)) * fₛ 
@test subs(fₛ ,  ([x[2:n]; x[1]] .=> x)...) .≈ only(ρₛ(c)) * fₛ 



# p = 0
fₜ

# p = 1
@test rank(coeff_matrix(
    [
        (x[1]+x[2]+x[3])*fₜ;
        f₂₊₁], monomials(x, 1))
        ) == 3

# p = 2
@test length([(x[1]^2+x[2]^2+x[3]^2)*fₜ;
    (x[1]+x[2]+x[3])^2*fₜ;
    (x[1]+x[2]+x[3])*f₂₊₁;
    f₂₊₁₂;
    ]) == 6

# p = 3
@test length([(x[1]^3+x[2]^3+x[3]^3)*fₜ;
    (x[1]+x[2]+x[3])*(x[1]^2+x[2]^2+x[3]^2)*fₜ;
    (x[1]+x[2]+x[3])^3*fₜ;
    (x[1]^2+x[2]^2+x[3]^2)*f₂₊₁;
    (x[1]+x[2]+x[3])^2*f₂₊₁;
    (x[1]+x[2]+x[3])*f₂₊₁₂;
    fₛ ;
    ]) == 10



####
# 2D
####

@test multiplicities(ρₛ ⊗ ρₜ)[Partition(1,1,1)] == multiplicities(ρₜ ⊗ ρₛ)[Partition(1,1,1)] == 1
@test multiplicities(ρ₂₊₁ ⊗ ρ₂₊₁)[Partition(1,1,1)] == 1
λ,Q = blockdiagonalize(ρ₂₊₁ ⊗ ρ₂₊₁)
@test Q[:,1] ≈ [0,1/sqrt(2),-1/sqrt(2),0]

# p = 2
F₃ = f₂₊₁[2]subs(f₂₊₁[1],(x .=> y)...) - f₂₊₁[1]subs(f₂₊₁[2],(x .=> y)...)

# p = 3
F₁ = fₛ  # ρₛ ⊗ ρₜ
F₂ = subs(fₛ ,(x .=> y)...) # ρₜ ⊗ ρₛ
F₄ = f₂₊₁[2]subs(f₂₊₁₂[1],(x .=> y)...) - f₂₊₁[1]subs(f₂₊₁₂[2],(x .=> y)...)
F₅ = f₂₊₁₂[2]subs(f₂₊₁[1],(x .=> y)...) - f₂₊₁₂[1]subs(f₂₊₁[2],(x .=> y)...)
# + invariant * F₃
# F₃ * (x[1]+x[2]+x[3])
# F₃ * (y[1]+y[2]+y[3])

# p = 4
F₆ = f₂₊₁₂[2]subs(f₂₊₁₂[1],(x .=> y)...) - f₂₊₁₂[1]subs(f₂₊₁₂[2],(x .=> y)...)


for F in (F₁,F₂,F₃,F₄,F₅,F₆)
    @test subs(F, x[1] => x[2], x[2] => x[1], y[1] => y[2], y[2] => y[1]) ≈ -F
    @test subs(F,  ([x[2:n]; x[1]] .=> x)..., ([y[2:n]; y[1]] .=> y)...) ≈ F
end

####
# 3D
####

@test !haskey(multiplicities(ρₜ ⊗ ρₜ ⊗ ρₜ), Partition(1,1,1))
@test multiplicities(ρₜ ⊗ ρₜ ⊗ ρₛ)[Partition(1,1,1)] == 1
@test !haskey(multiplicities(ρₜ ⊗ ρₜ ⊗ ρ₂₊₁), Partition(1,1,1))
@test !haskey(multiplicities(ρₜ ⊗ ρₛ ⊗ ρₛ), Partition(1,1,1))
@test !haskey(multiplicities(ρₜ ⊗ ρₛ ⊗ ρ₂₊₁), Partition(1,1,1))
@test multiplicities(ρₜ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁)[Partition(1,1,1)] == 1
@test multiplicities(ρₛ ⊗ ρₛ ⊗ ρₛ)[Partition(1,1,1)] == 1
@test !haskey(multiplicities(ρₛ ⊗ ρₛ ⊗ ρ₂₊₁), Partition(1,1,1))
@test multiplicities(ρₛ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁)[Partition(1,1,1)] == 1
@test multiplicities(ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁)[Partition(1,1,1)] == 1

@test blockdiagonalize(ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁)[2][:,1] ≈ -[-1,0,0,1,0,1,1,0]/2


Fs = [
# p = 2
F₃ # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρₜ
subs(F₃,(y .=> z)...) # ρ₂₊₁ ⊗ ρₜ ⊗ ρ₂₊₁
subs(F₃,(x .=> y)..., (y .=> z)...) # ρₜ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁

# p = 3
fₛ # ρₛ ⊗ ρₜ ⊗ ρₜ
subs(fₛ,(x .=> y)...) # ρₜ ⊗ ρₛ ⊗ ρₜ
subs(fₛ,(x .=> z)...) # ρₜ ⊗ ρₜ ⊗ ρₛ
F₄ # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρₜ
subs(F₄,(y .=> z)...) # ρ₂₊₁ ⊗ ρₜ ⊗ ρ₂₊₁
subs(F₄,(x .=> y)..., (y .=> z)...) # ρₜ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁
F₅ # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρₜ
subs(F₅,(y .=> z)...) # ρ₂₊₁ ⊗ ρₜ ⊗ ρ₂₊₁
subs(F₅,(x .=> y)..., (y .=> z)...) # ρₜ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁
-f₂₊₁[1]subs(f₂₊₁[1],(x .=> y)...)subs(f₂₊₁[1],(x .=> z)...) + f₂₊₁[1]subs(f₂₊₁[2],(x .=> y)...)subs(f₂₊₁[2],(x .=> z)...) + f₂₊₁[2]subs(f₂₊₁[1],(x .=> y)...)subs(f₂₊₁[2],(x .=> z)...) + f₂₊₁[2]subs(f₂₊₁[2],(x .=> y)...)subs(f₂₊₁[1],(x .=> z)...) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁


# p = 4
F₆ # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρₜ
subs(F₆,(y .=> z)...) # ρ₂₊₁ ⊗ ρₜ ⊗ ρ₂₊₁
subs(F₆,(x .=> y)..., (y .=> z)...) # ρₜ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁
-f₂₊₁₂[1]subs(f₂₊₁[1],(x .=> y)...)subs(f₂₊₁[1],(x .=> z)...) + f₂₊₁₂[1]subs(f₂₊₁[2],(x .=> y)...)subs(f₂₊₁[2],(x .=> z)...) + f₂₊₁₂[2]subs(f₂₊₁[1],(x .=> y)...)subs(f₂₊₁[2],(x .=> z)...) + f₂₊₁₂[2]subs(f₂₊₁[2],(x .=> y)...)subs(f₂₊₁[1],(x .=> z)...) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁
-f₂₊₁[1]subs(f₂₊₁₂[1],(x .=> y)...)subs(f₂₊₁[1],(x .=> z)...) + f₂₊₁[1]subs(f₂₊₁₂[2],(x .=> y)...)subs(f₂₊₁[2],(x .=> z)...) + f₂₊₁[2]subs(f₂₊₁₂[1],(x .=> y)...)subs(f₂₊₁[2],(x .=> z)...) + f₂₊₁[2]subs(f₂₊₁₂[2],(x .=> y)...)subs(f₂₊₁[1],(x .=> z)...) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁
-f₂₊₁[1]subs(f₂₊₁[1],(x .=> y)...)subs(f₂₊₁₂[1],(x .=> z)...) + f₂₊₁[1]subs(f₂₊₁[2],(x .=> y)...)subs(f₂₊₁₂[2],(x .=> z)...) + f₂₊₁[2]subs(f₂₊₁[1],(x .=> y)...)subs(f₂₊₁₂[2],(x .=> z)...) + f₂₊₁[2]subs(f₂₊₁[2],(x .=> y)...)subs(f₂₊₁₂[1],(x .=> z)...) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁

# p = 5
(f₂₊₁[1]subs(f₂₊₁[1],(x .=> y)...) + f₂₊₁[2]subs(f₂₊₁[2],(x .=> y)...))*subs(fₛ , x=>z) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρₛ
(f₂₊₁[1]subs(f₂₊₁[1],(x .=> z)...) + f₂₊₁[2]subs(f₂₊₁[2],(x .=> z)...))*subs(fₛ , x=>y) # ρ₂₊₁ ⊗ ρₛ ⊗ ρ₂₊₁
fₛ *(subs(f₂₊₁[1],(x .=> y)...)subs(f₂₊₁[1],(x .=> z)...) + subs(f₂₊₁[2],(x .=> y)...)subs(f₂₊₁[2],(x .=> z)...)) # ρₛ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁
-f₂₊₁₂[1]subs(f₂₊₁₂[1],(x .=> y)...)subs(f₂₊₁[1],(x .=> z)...) + f₂₊₁₂[1]subs(f₂₊₁₂[2],(x .=> y)...)subs(f₂₊₁[2],(x .=> z)...) + f₂₊₁₂[2]subs(f₂₊₁₂[1],(x .=> y)...)subs(f₂₊₁[2],(x .=> z)...) + f₂₊₁₂[2]subs(f₂₊₁₂[2],(x .=> y)...)subs(f₂₊₁[1],(x .=> z)...) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁
-f₂₊₁₂[1]subs(f₂₊₁[1],(x .=> y)...)subs(f₂₊₁₂[1],(x .=> z)...) + f₂₊₁₂[1]subs(f₂₊₁[2],(x .=> y)...)subs(f₂₊₁₂[2],(x .=> z)...) + f₂₊₁₂[2]subs(f₂₊₁[1],(x .=> y)...)subs(f₂₊₁₂[2],(x .=> z)...) + f₂₊₁₂[2]subs(f₂₊₁[2],(x .=> y)...)subs(f₂₊₁₂[1],(x .=> z)...) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁
-f₂₊₁[1]subs(f₂₊₁₂[1],(x .=> y)...)subs(f₂₊₁₂[1],(x .=> z)...) + f₂₊₁[1]subs(f₂₊₁₂[2],(x .=> y)...)subs(f₂₊₁₂[2],(x .=> z)...) + f₂₊₁[2]subs(f₂₊₁₂[1],(x .=> y)...)subs(f₂₊₁₂[2],(x .=> z)...) + f₂₊₁[2]subs(f₂₊₁₂[2],(x .=> y)...)subs(f₂₊₁₂[1],(x .=> z)...) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁

# p = 6
(f₂₊₁[1]subs(f₂₊₁₂[1],(x .=> y)...) + f₂₊₁[2]subs(f₂₊₁₂[2],(x .=> y)...))*subs(fₛ , x=>z) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρₛ
(f₂₊₁[1]subs(f₂₊₁₂[1],(x .=> z)...) + f₂₊₁[2]subs(f₂₊₁₂[2],(x .=> z)...))*subs(fₛ , x=>y) # ρ₂₊₁ ⊗ ρₛ ⊗ ρ₂₊₁
fₛ *(subs(f₂₊₁[1],(x .=> y)...)subs(f₂₊₁₂[1],(x .=> z)...) + subs(f₂₊₁[2],(x .=> y)...)subs(f₂₊₁₂[2],(x .=> z)...)) # ρₛ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁
(f₂₊₁₂[1]subs(f₂₊₁[1],(x .=> y)...) + f₂₊₁₂[2]subs(f₂₊₁[2],(x .=> y)...))*subs(fₛ , x=>z) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρₛ
(f₂₊₁₂[1]subs(f₂₊₁[1],(x .=> z)...) + f₂₊₁₂[2]subs(f₂₊₁[2],(x .=> z)...))*subs(fₛ , x=>y) # ρ₂₊₁ ⊗ ρₛ ⊗ ρ₂₊₁
fₛ *(subs(f₂₊₁₂[1],(x .=> y)...)subs(f₂₊₁[1],(x .=> z)...) + subs(f₂₊₁₂[2],(x .=> y)...)subs(f₂₊₁[2],(x .=> z)...)) # ρₛ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁
-f₂₊₁₂[1]subs(f₂₊₁₂[1],(x .=> y)...)subs(f₂₊₁₂[1],(x .=> z)...) + f₂₊₁₂[1]subs(f₂₊₁₂[2],(x .=> y)...)subs(f₂₊₁₂[2],(x .=> z)...) + f₂₊₁₂[2]subs(f₂₊₁₂[1],(x .=> y)...)subs(f₂₊₁₂[2],(x .=> z)...) + f₂₊₁₂[2]subs(f₂₊₁₂[2],(x .=> y)...)subs(f₂₊₁₂[1],(x .=> z)...) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁

# p = 7
(f₂₊₁₂[1]subs(f₂₊₁₂[1],(x .=> y)...) + f₂₊₁₂[2]subs(f₂₊₁₂[2],(x .=> y)...))*subs(fₛ , x=>z) # ρ₂₊₁ ⊗ ρ₂₊₁ ⊗ ρₛ
(f₂₊₁₂[1]subs(f₂₊₁₂[1],(x .=> z)...) + f₂₊₁₂[2]subs(f₂₊₁₂[2],(x .=> z)...))*subs(fₛ , x=>y) # ρ₂₊₁ ⊗ ρₛ ⊗ ρ₂₊₁
fₛ *(subs(f₂₊₁₂[1],(x .=> y)...)subs(f₂₊₁₂[1],(x .=> z)...) + subs(f₂₊₁₂[2],(x .=> y)...)subs(f₂₊₁₂[2],(x .=> z)...)) # ρₛ ⊗ ρ₂₊₁ ⊗ ρ₂₊₁

# p = 9
fₛ  * subs(fₛ , x=>y) * subs(fₛ , x=>z) # ρₛ ⊗ ρₛ ⊗ ρₛ
]


@test rank(coeff_matrix(Fs, vcat((monomials([x;y;z], k) for k=0:9)...))) == 36


k = 1
for F in Fs
    @show k
    @test subs(F, x[1] => x[2], x[2] => x[1], y[1] => y[2], y[2] => y[1], z[1] => z[2], z[2] => z[1]) ≈ -F atol=1E-12
    @test subs(F,  ([x[2:n]; x[1]] .=> x)..., ([y[2:n]; y[1]] .=> y)..., ([z[2:n]; z[1]] .=> z)...) ≈ F atol=1E-12
    k += 1
end


######
# n = 4
######

n = 4
@polyvar x[1:n] monomial_order = Graded{DynamicPolynomials.Reverse{LexOrder}}
@polyvar y[1:n] monomial_order = Graded{DynamicPolynomials.Reverse{LexOrder}}
@polyvar z[1:n] monomial_order = Graded{DynamicPolynomials.Reverse{LexOrder}}


τ₁ = Permutation([[1,2], fill.(3:n,1)...])
c = Permutation([Vector(1:n)])

ρₚ₁ = polypermgen(n, 1)
ρₚ₂ = polypermgen(n, 2)
ρₚ₃ = polypermgen(n, 3)
ρₚ₄ = polypermgen(n, 4)
ρₚ₅ = polypermgen(n, 5)
@test all(subs(x, x[1] => x[2], x[2] => x[1]) .≈ ρₚ₁(τ₁) * x)
@test all(subs(x,  ([x[2:n]; x[1]] .=> x)...) .≈ ρₚ₁(c) * x)

ρₜ = Representation(4)
ρ₃₊₁ = Representation(3,1)
ρ₂₊₂ = Representation(2,2)
ρ₂₊₁₊₁ = Representation(2,1,1)
ρₛ = Representation(1,1,1,1)


fₜ = 1
f₃₊₁ = [(x[1]-x[2])/sqrt(2), (x[1]+x[2])/sqrt(6)-2x[3]/sqrt(6), (x[1]+x[2]+x[3])/sqrt(12)-sqrt(3)/2 * x[4]]
f₃₊₁₂ = [(x[1]^2-x[2]^2)/sqrt(2), (x[1]^2+x[2]^2)/sqrt(6)-2x[3]^2/sqrt(6), (x[1]^2+x[2]^2+x[3]^2)/sqrt(12)-sqrt(3)/2 * x[4]^2]
f₃₊₁₃ = [(x[1]^3-x[2]^3)/sqrt(2), (x[1]^3+x[2]^3)/sqrt(6)-2x[3]^3/sqrt(6), (x[1]^3+x[2]^3+x[3]^3)/sqrt(12)-sqrt(3)/2 * x[4]^3]
f₂₊₂ =  -[(x[1]x[3]-x[1]x[4]-x[2]x[3]+x[2]x[4])/2, (x[1]x[2]+x[3]x[4])/sqrt(3) - (x[1]x[3]+x[1]x[4]+x[2]x[3]+x[2]x[4])/sqrt(12)]
f₂₊₂₂ =  [(x[1]^2*x[3]^2-x[1]^2*x[4]^2-x[2]^2*x[3]^2+x[2]^2*x[4]^2)/2, (x[1]^2*x[2]^2+x[3]^2*x[4]^2)/sqrt(3) - (x[1]^2*x[3]^2+x[1]^2*x[4]^2+x[2]^2*x[3]^2+x[2]^2*x[4]^2)/sqrt(12)]
f₂₊₁₊₁ = [(x[1]^2*x[2]-x[1]^2*x[3]-x[1]x[2]^2+x[1]x[3]^2+x[2]^2*x[3]-x[2]x[3]^2)/sqrt(6), 
          (2x[1]^2*x[2]+x[1]^2*x[3]-3x[1]^2*x[4]-2x[1]x[2]^2-x[1]x[3]^2+3x[1]x[4]^2-x[2]^2*x[3]+3x[2]^2*x[4]+x[2]x[3]^2-3x[2]x[4]^2)/sqrt(48),
          (x[1]^2*x[3]-x[1]^2*x[4]-x[1]x[3]^2+x[1]x[4]^2+x[2]^2*x[3]-x[2]^2*x[4]-x[2]x[3]^2+x[2]x[4]^2+2x[3]^2*x[4]-2x[3]x[4]^2)/4]
f₂₊₁₊₁₂ = [x[1]^2*x[2]x[4]-x[1]^2*x[3]x[4]-x[1]x[2]^2*x[4]+x[1]x[3]^2*x[4]+x[2]^2*x[3]x[4]-x[2]x[3]^2*x[4],
            (3x[1]^2*x[2]x[3]-x[1]^2*x[2]x[4]-2x[1]^2*x[3]x[4]-3x[1]x[2]^2*x[3]+x[1]x[2]^2*x[4]-x[1]x[3]^2*x[4]+3x[1]x[3]x[4]^2+2x[2]^2*x[3]x[4]+x[2]x[3]^2*x[4]-3x[2]x[3]x[4]^2)/sqrt(8),
            (x[1]^2*x[2]x[3]-x[1]^2*x[2]x[4]+x[1]x[2]^2*x[3]-x[1]x[2]^2*x[4]-2x[1]x[2]x[3]^2+2x[1]x[2]x[4]^2+x[1]x[3]^2*x[4]-x[1]x[3]x[4]^2+x[2]x[3]^2*x[4]-x[2]x[3]x[4]^2)/sqrt(8/3)
            ]
f₂₊₁₊₁₃ = [(x[1]^2*x[2]^3-x[1]^2*x[3]^3-x[1]^3*x[2]^2+x[1]^3*x[3]^2+x[2]^2*x[3]^3-x[2]^3*x[3]^2)/sqrt(6), 
          (2x[1]^2*x[2]^3+x[1]^2*x[3]^3-3x[1]^2*x[4]^3-2x[1]^3*x[2]^2-x[1]^3*x[3]^2+3x[1]^3*x[4]^2-x[2]^2*x[3]^3+3x[2]^2*x[4]^3+x[2]^3*x[3]^2-3x[2]^3*x[4]^2)/sqrt(48),
          (x[1]^2*x[3]^3-x[1]^2*x[4]^3-x[1]^3*x[3]^2+x[1]^3*x[4]^2+x[2]^2*x[3]^3-x[2]^2*x[4]^3-x[2]^3*x[3]^2+x[2]^3*x[4]^2+2x[3]^2*x[4]^3-2x[3]^3*x[4]^2)/4]
fₛ = (x[1]-x[2])*(x[1]-x[3])*(x[1]-x[4])*(x[2]-x[3])*(x[2]-x[4])*(x[3]-x[4])

@test all(f₃₊₁ .≈ blockdiagonalize(ρₚ₁)[2][:,1:3]'x)
@test all(f₂₊₂ .≈ blockdiagonalize(ρₚ₂)[2][:,1:2]'monomials(x, 2))
@test all(f₂₊₁₊₁ .≈ blockdiagonalize(ρₚ₃)[2][:,1:3]'monomials(x, 3))


A = (blockdiagonalize(ρₚ₄)[2][:,1:3] - blockdiagonalize(ρₚ₄)[2][:,1:3][2]/coeff_matrix((x[1]+x[2]+x[3]+x[4])*f₂₊₁₊₁, monomials(x,4))[2] * coeff_matrix((x[1]+x[2]+x[3]+x[4])*f₂₊₁₊₁, monomials(x,4)))
B = A/A[7]
@test B ≈ coeff_matrix(f₂₊₁₊₁₂, monomials(x,4))


@test all(subs(fₜ, x[1] => x[2], x[2] => x[1]) .≈ ρₜ(τ₁) * fₜ)
@test all(subs(fₜ,  ([x[2:n]; x[1]] .=> x)...) .≈ ρₜ(c) * fₜ)

@test all(subs(f₃₊₁, x[1] => x[2], x[2] => x[1]) .≈ ρ₃₊₁(τ₁) * f₃₊₁)
@test all(subs(f₃₊₁,  ([x[2:n]; x[1]] .=> x)...) .≈ ρ₃₊₁(c) * f₃₊₁)
@test all(subs(f₃₊₁₂, x[1] => x[2], x[2] => x[1]) .≈ ρ₃₊₁(τ₁) * f₃₊₁₂)
@test all(subs(f₃₊₁₂,  ([x[2:n]; x[1]] .=> x)...) .≈ ρ₃₊₁(c) * f₃₊₁₂)
@test all(subs(f₂₊₂, x[1] => x[2], x[2] => x[1]) .≈ ρ₂₊₂(τ₁) * f₂₊₂)
@test all(subs(f₂₊₂,  ([x[2:n]; x[1]] .=> x)...) .≈ ρ₂₊₂(c) * f₂₊₂)
@test all(subs(f₂₊₁₊₁, x[1] => x[2], x[2] => x[1]) .≈ ρ₂₊₁₊₁(τ₁) * f₂₊₁₊₁)
@test all(broadcast((a,b) -> ≈(a,b;atol=1E-12), subs(f₂₊₁₊₁, ([x[2:n]; x[1]] .=> x)...), ρ₂₊₁₊₁(c) * f₂₊₁₊₁))
@test all(subs(f₂₊₁₊₁₂, x[1] => x[2], x[2] => x[1]) .≈ ρ₂₊₁₊₁(τ₁) * f₂₊₁₊₁₂)
@test all(broadcast((a,b) -> ≈(a,b;atol=1E-12), subs(f₂₊₁₊₁₂, ([x[2:n]; x[1]] .=> x)...), ρ₂₊₁₊₁(c) * f₂₊₁₊₁₂))
@test all(subs(f₂₊₁₊₁₃, x[1] => x[2], x[2] => x[1]) .≈ ρ₂₊₁₊₁(τ₁) * f₂₊₁₊₁₃)
@test all(broadcast((a,b) -> ≈(a,b;atol=1E-12), subs(f₂₊₁₊₁₃, ([x[2:n]; x[1]] .=> x)...), ρ₂₊₁₊₁(c) * f₂₊₁₊₁₃))


# p = 0
fₜ

# p = 1
@test length([
(x[1] + x[2] + x[3] + x[4])*fₜ;
f₃₊₁
]) == 4

# p = 2
@test rank(coeff_matrix([
(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*fₜ;
(x[1]+x[2]+x[3]+x[4])^2*fₜ;
(x[1] + x[2] + x[3] + x[4])*f₃₊₁;
f₃₊₁₂;
f₂₊₂
], monomials(x,2))) == size(ρₚ₂,1)

# p = 3
@test rank(coeff_matrix([
(x[1]^3 + x[2]^3 + x[3]^3 + x[4]^3)*fₜ;
(x[1]+x[2]+x[3]+x[4])*(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*fₜ;
(x[1]+x[2]+x[3]+x[4])^3*fₜ;
(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])^2*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])*f₃₊₁₂;
f₃₊₁₃;
(x[1]+x[2]+x[3]+x[4])*f₂₊₂;
f₂₊₁₊₁
], monomials(x,3))) == size(ρₚ₃,1)

# p = 4
@test rank(coeff_matrix([
(x[1]^4 + x[2]^4 + x[3]^4 + x[4]^4)*fₜ;
(x[1]+x[2]+x[3]+x[4])*(x[1]^3 + x[2]^3 + x[3]^3 + x[4]^3)*fₜ;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*fₜ;
(x[1]+x[2]+x[3]+x[4])^4*fₜ;
(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)^2*fₜ;
(x[1]^3 + x[2]^3 + x[3]^3 + x[4]^3)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])*(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])^3*f₃₊₁;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₃₊₁₂;
(x[1]+x[2]+x[3]+x[4])^2*f₃₊₁₂;
(x[1]+x[2]+x[3]+x[4])*f₃₊₁₃;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₂;
(x[1]+x[2]+x[3]+x[4])^2*f₂₊₂;
f₂₊₂₂;
(x[1]+x[2]+x[3]+x[4])*f₂₊₁₊₁;
f₂₊₁₊₁₂
], monomials(x,4))) == size(ρₚ₄,1)

# p = 5
@test rank(coeff_matrix([
(x[1]^5 + x[2]^5 + x[3]^5 + x[4]^5)*fₜ;
(x[1]+x[2]+x[3]+x[4])*(x[1]^4 + x[2]^4 + x[3]^4 + x[4]^4)*fₜ;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^3 + x[2]^3 + x[3]^3 + x[4]^3)*fₜ;
(x[1]+x[2]+x[3]+x[4])^3*(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*fₜ;
(x[1]+x[2]+x[3]+x[4])^5*fₜ;
(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*(x[1]^3 + x[2]^3 + x[3]^3 + x[4]^3)*fₜ;
(x[1]^4 + x[2]^4 + x[3]^4 + x[4]^4)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])*(x[1]^3 + x[2]^3 + x[3]^3 + x[4]^3)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])^4*f₃₊₁;
(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)^2*f₃₊₁;
(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₃₊₁₂;
(x[1]+x[2]+x[3]+x[4])*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₃₊₁₂;
(x[1]+x[2]+x[3]+x[4])^3*f₃₊₁₂;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₃₊₁₃;
(x[1]+x[2]+x[3]+x[4])^2*f₃₊₁₃;
(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₂₊₂;
(x[1]+x[2]+x[3]+x[4])*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₂;
(x[1]+x[2]+x[3]+x[4])^3*f₂₊₂;
(x[1]+x[2]+x[3]+x[4])*f₂₊₂₂;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₁₊₁;
(x[1]+x[2]+x[3]+x[4])^2*f₂₊₁₊₁;
(x[1]+x[2]+x[3]+x[4])*f₂₊₁₊₁₂;
f₂₊₁₊₁₃
], monomials(x,5))) == size(ρₚ₅,1)


# p = 6
@test rank(coeff_matrix([
(x[1]^6 + x[2]^6 + x[3]^6 + x[4]^6)*fₜ;
(x[1]+x[2]+x[3]+x[4])*(x[1]^5 + x[2]^5 + x[3]^5 + x[4]^5)*fₜ;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^4 + x[2]^4 + x[3]^4 + x[4]^4)*fₜ;
(x[1]+x[2]+x[3]+x[4])^3*(x[1]^3 + x[2]^3 + x[3]^3 + x[4]^3)*fₜ;
(x[1]+x[2]+x[3]+x[4])^4*(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*fₜ;
(x[1]+x[2]+x[3]+x[4])^6*fₜ;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*(x[1]^4+x[2]^4+x[3]^4+x[4]^4)*fₜ;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)^3*fₜ;
(x[1]^3+x[2]^3+x[3]^3+x[4]^3)^2*fₜ;
(x[1]^5 + x[2]^5 + x[3]^5 + x[4]^5)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])*(x[1]^4 + x[2]^4 + x[3]^4 + x[4]^4)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^3 + x[2]^3 + x[3]^3 + x[4]^3)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])^3*(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])^5*f₃₊₁;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₃₊₁;
(x[1]^4+x[2]^4+x[3]^4+x[4]^4)*f₃₊₁₂;
(x[1]+x[2]+x[3]+x[4])*(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₃₊₁₂;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₃₊₁₂;
(x[1]+x[2]+x[3]+x[4])^4*f₃₊₁₂;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)^2*f₃₊₁₂;
(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₃₊₁₃;
(x[1]+x[2]+x[3]+x[4])*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₃₊₁₃;
(x[1]+x[2]+x[3]+x[4])^3*f₃₊₁₃;
(x[1]^4+x[2]^4+x[3]^4+x[4]^4)*f₂₊₂;
(x[1]+x[2]+x[3]+x[4])*(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₂₊₂;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₂;
(x[1]+x[2]+x[3]+x[4])^4*f₂₊₂;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)^2*f₂₊₂;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₂₂;
(x[1]+x[2]+x[3]+x[4])^2*f₂₊₂₂;
(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₂₊₁₊₁;
(x[1]+x[2]+x[3]+x[4])*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₁₊₁;
(x[1]+x[2]+x[3]+x[4])^3*f₂₊₁₊₁;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₁₊₁₂;
(x[1]+x[2]+x[3]+x[4])^2*f₂₊₁₊₁₂;
(x[1]+x[2]+x[3]+x[4])*f₂₊₁₊₁₃;
fₛ
], monomials(x,6))) == size(polypermgen(n,6),1)


@test rank(coeff_matrix([
(x[1]^7 + x[2]^7 + x[3]^7 + x[4]^7)*fₜ;
(x[1]+x[2]+x[3]+x[4])*(x[1]^6 + x[2]^6 + x[3]^6 + x[4]^6)*fₜ;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^5 + x[2]^5 + x[3]^5 + x[4]^5)*fₜ;
(x[1]+x[2]+x[3]+x[4])^3*(x[1]^4 + x[2]^4 + x[3]^4 + x[4]^4)*fₜ;
(x[1]+x[2]+x[3]+x[4])^4*(x[1]^3 + x[2]^3 + x[3]^3 + x[4]^3)*fₜ;
(x[1]+x[2]+x[3]+x[4])^5*(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*fₜ;
(x[1]+x[2]+x[3]+x[4])^7*fₜ;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*(x[1]^5+x[2]^5+x[3]^5+x[4]^5)*fₜ;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)^2*(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*fₜ;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)^3*(x[1]+x[2]+x[3]+x[4])*fₜ;
(x[1]^3+x[2]^3+x[3]^3+x[4]^3)^2*(x[1]+x[2]+x[3]+x[4])*fₜ;
(x[1]^6 + x[2]^6 + x[3]^6 + x[4]^6)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])*(x[1]^5 + x[2]^5 + x[3]^5 + x[4]^5)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^4 + x[2]^4 + x[3]^4 + x[4]^4)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])^3*(x[1]^3 + x[2]^3 + x[3]^3 + x[4]^3)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])^4*(x[1]^2 + x[2]^2 + x[3]^2 + x[4]^2)*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])^6*f₃₊₁;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*(x[1]^4+x[2]^4+x[3]^4+x[4]^4)*f₃₊₁;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)^3*f₃₊₁;
(x[1]^3+x[2]^3+x[3]^3+x[4]^3)^2*f₃₊₁;
(x[1]+x[2]+x[3]+x[4])*(x[1]^4+x[2]^4+x[3]^4+x[4]^4)*f₃₊₁₂;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₃₊₁₂;
(x[1]+x[2]+x[3]+x[4])^3*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₃₊₁₂;
(x[1]+x[2]+x[3]+x[4])^5*f₃₊₁₂;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)^2*(x[1]+x[2]+x[3]+x[4])*f₃₊₁₂;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₃₊₁₂;
(x[1]^4+x[2]^4+x[3]^4+x[4]^4)*f₃₊₁₃;
(x[1]+x[2]+x[3]+x[4])*(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₃₊₁₃;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₃₊₁₃;
(x[1]+x[2]+x[3]+x[4])^4*f₃₊₁₃;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)^2*f₃₊₁₃;
(x[1]^5+x[2]^5+x[3]^5+x[4]^5)*f₂₊₂;
(x[1]+x[2]+x[3]+x[4])*(x[1]^4+x[2]^4+x[3]^4+x[4]^4)*f₂₊₂;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₂₊₂;
(x[1]+x[2]+x[3]+x[4])^3*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₂;
(x[1]+x[2]+x[3]+x[4])^5*f₂₊₂;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)^2*(x[1]+x[2]+x[3]+x[4])*f₂₊₂;
# (x[1]^2+x[2]^2+x[3]^2+x[4]^2)*(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₂₊₂;
(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₂₊₂₂;
(x[1]+x[2]+x[3]+x[4])*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₂₂;
(x[1]+x[2]+x[3]+x[4])^3*f₂₊₂₂;
(x[1]^4+x[2]^4+x[3]^4+x[4]^4)*f₂₊₁₊₁;
(x[1]+x[2]+x[3]+x[4])*(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₂₊₁₊₁;
(x[1]+x[2]+x[3]+x[4])^2*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₁₊₁;
(x[1]+x[2]+x[3]+x[4])^4*f₂₊₁₊₁;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)^2*f₂₊₁₊₁;
(x[1]^3+x[2]^3+x[3]^3+x[4]^3)*f₂₊₁₊₁₂;
(x[1]+x[2]+x[3]+x[4])*(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₁₊₁₂;
(x[1]+x[2]+x[3]+x[4])^3*f₂₊₁₊₁₂;
(x[1]^2+x[2]^2+x[3]^2+x[4]^2)*f₂₊₁₊₁₃;
(x[1]+x[2]+x[3]+x[4])^2*f₂₊₁₊₁₃;
(x[1]+x[2]+x[3]+x[4])*fₛ
], monomials(x,7))) == size(polypermgen(n,7),1)


###
# n = 4
###

blockdiagonalize(ρ₂₊₁ ⊗ ρ₂₊₁)

@test multiplicities(ρₜ ⊗ ρₛ)[Partition(1,1,1,1)] == 1
@test multiplicities(ρ₃₊₁ ⊗ ρ₂₊₁₊₁)[Partition(1,1,1,1)] == 1
@test multiplicities(ρ₂₊₂ ⊗ ρ₂₊₂)[Partition(1,1,1,1)] == 1

@test !haskey(multiplicities(ρ₃₊₁ ⊗ ρ₃₊₁),Partition(1,1,1,1))
@test !haskey(multiplicities(ρ₂₊₁₊₁ ⊗ ρ₂₊₁₊₁),Partition(1,1,1,1))
@test !haskey(multiplicities(ρ₂₊₁₊₁ ⊗ ρ₂₊₂),Partition(1,1,1,1))
@test !haskey(multiplicities(ρ₃₊₁ ⊗ ρₛ),Partition(1,1,1,1))
@test !haskey(multiplicities(ρ₂₊₁₊₁ ⊗ ρₛ),Partition(1,1,1,1))
@test !haskey(multiplicities(ρₛ ⊗ ρ₂₊₂),Partition(1,1,1,1))

###
# 3D
###

@test multiplicities(ρₜ ⊗ ρₜ ⊗ ρₛ)[Partition(1,1,1,1)] == 1
@test multiplicities(ρₜ ⊗ ρ₃₊₁ ⊗ ρ₂₊₁₊₁)[Partition(1,1,1,1)] == 1
@test multiplicities(ρₜ ⊗ ρ₂₊₂ ⊗ ρ₂₊₂)[Partition(1,1,1,1)] == 1
@test multiplicities(ρ₂₊₂ ⊗ ρ₂₊₂ ⊗ ρ₂₊₂)[Partition(1,1,1,1)] == 1
@test multiplicities(ρ₃₊₁ ⊗ ρ₃₊₁ ⊗ ρ₂₊₂)[Partition(1,1,1,1)] == 1
@test multiplicities(ρ₃₊₁ ⊗ ρ₃₊₁ ⊗ ρ₃₊₁)[Partition(1,1,1,1)] == 1
@test multiplicities(ρ₃₊₁ ⊗ ρ₃₊₁ ⊗ ρ₂₊₁₊₁)[Partition(1,1,1,1)] == 1
@test !haskey(multiplicities(ρ₃₊₁ ⊗ ρ₂₊₂ ⊗ ρ₂₊₂), Partition(1,1,1,1))

blockdiagonalize(ρ₂₊₂ ⊗ ρ₂₊₂ ⊗ ρ₂₊₂)[2][:,1]
blockdiagonalize(ρ₃₊₁ ⊗ ρ₃₊₁ ⊗ ρ₃₊₁)[2][:,1]
blockdiagonalize(ρ₃₊₁ ⊗ ρ₃₊₁ ⊗ ρ₂₊₁₊₁)[2][:,1]